Revit 2027 API
AdvancedWood.WoodSecondaryPerlinEnable Property
 The property labeled "Use perlin noise for secondary highlight" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WoodSecondaryPerlinEnable { get; }
Public Shared ReadOnly Property WoodSecondaryPerlinEnable As String
	Get
public:
static property String^ WoodSecondaryPerlinEnable {
	String^ get ();
}
static member WoodSecondaryPerlinEnable : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Reference
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace